#Область СлужебныйПрограммныйИнтерфейс

Функция ВидыНалоговУплачиваемыеОтдельно(Период) Экспорт
	
	ТипыНалогов = Новый Массив;
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ЕдиныйНалоговыйПлатеж);
	ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ФССНС);
	Если Период >= ЕдиныйНалоговыйСчет.ДатаВыделенияДополнительныхВзносовЛетчиковИШахтеровИзСоставаЕНП() Тогда
		ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ПФРДополнительныйТарифШахтеры);
		ТипыНалогов.Добавить(Перечисления.ТипыНалогов.ПФРДополнительныйТарифЛЭ);
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(ТипыНалогов);
	
КонецФункции


#КонецОбласти
